bash/bashrc.org
#+TITLE: bash configuration
#+PROPERTY: header-args+ :results output silent :noweb tangle :comments both :mkdirp yes

* bashrc
:PROPERTIES:
:header-args+: :tangle bashrc_literate
:END:
#+begin_src bash :export none
  # This is a tangled file. Do not make any changes here. All changes should preferably be made in the original Org file.
  # Use =org-babel-tangle-jump-to-org= to jump back to it from any code block.
  # If any changes are made here, use =org-babel-detangle= to add it back to the original Org mode file.
#+end_src

** local init
Any local settings that need to be set initially go here

#+begin_src bash :tangle (if (string-match "buntu" (system-name)) "bashrc_literate" "no")
[[ -d /opt/fzf ]] && export FZF_PATH=/opt/fzf
#+end_src

** interactive, login shell settings
How to check for login v/s interactive shell
#+begin_src bash :tangle no
shopt -q login_shell && echo "Login shell" || echo "Not a login shell"
[[ $- == *i* ]] && echo "This is an interactive shell" || echo "This is a script"
#+end_src

If shell is interactive turn off TTY "start" and "stop" commands in all interactive shells.
They default to ~C-q~ and ~C-s~. I want to use ~C-s~ to do forward history search.
#+begin_src bash
if [[ $- == *i* ]]; then
    stty start ''
    stty stop  ''
    stty -ixon # disable XON/XOFF flow control
    stty ixoff # enable sending (to app) of start/stop characters
    stty ixany # let any character restart output, not only start character
fi
#+end_src

** configuration
default permissions
#+begin_src bash
umask 007
#+end_src

[[https://unix.stackexchange.com/questions/32409/set-and-shopt-why-two][shopt v/s set]]

Using [[https://www.gnu.org/software/bash/manual/html_node/The-Shopt-Builtin.html][shopt]]:
~-s~ : set
~-u~ : unset
~-q~ : query whether set/unset

[[http://wiki.bash-hackers.org/internals/shell_options][List of shell options]]

If set, a command name that is the name of a directory is executed as if it were the argument to the cd command.
#+begin_src bash
shopt -u autocd
#+end_src

If this is set, an argument to the cd builtin command that is not a directory is assumed to be the name of a variable whose value is the directory to change to.
#+begin_src bash
shopt -s cdable_vars
#+end_src

If set, minor errors in the spelling of a directory component in a cd command will be corrected.
The errors checked for are transposed characters, a missing character, and a character too many.
If a correction is found, the corrected path is printed, and the command proceeds.
#+begin_src bash
shopt -s cdspell
#+end_src

If this is set, Bash checks that a command found in the hash table exists before trying to execute it.
If a hashed command no longer exists, a normal path search is performed.
#+begin_src bash
shopt -s checkhash
#+end_src

If set, Bash lists the status of any stopped and running jobs before exiting an interactive shell.
If any jobs are running, this causes the exit to be deferred until a second exit is attempted without an intervening command (see Job Control).
The shell always postpones exiting if any jobs are stopped.
#+begin_src bash
shopt -s checkjobs
#+end_src

If set, Bash checks the window size after each command and, if necessary, updates the values of LINES and COLUMNS.
#+begin_src bash
shopt -s checkwinsize
#+end_src

If set, Bash attempts to save all lines of a multiple-line command in the same history entry.
#+begin_src bash
shopt -s cmdhist
#+end_src

If set, Bash quotes all shell metacharacters in filenames and directory names when performing completion.
If not set, Bash removes metacharacters such as the dollar sign from the set of characters that will be quoted in completed filenames when these metacharacters appear in shell variable references in words to be completed.
This means that dollar signs in variable names that expand to directories will not be quoted; however, any dollar signs appearing in filenames will not be quoted, either.
This is active only when bash is using backslashes to quote completed filenames.
#+begin_src bash
shopt -s complete_fullquote
#+end_src

If set, Bash replaces directory names with the results of word expansion when performing filename completion.
This changes the contents of the readline editing buffer. If not set, Bash attempts to preserve what the user typed.
I use it mainly to prevent bash from escaping $ in $dir_variable
#+begin_src bash
shopt -s direxpand
#+end_src

If set, Bash attempts spelling correction on directory names during word completion if the directory name initially supplied does not exist.
#+begin_src bash
shopt -s dirspell
#+end_src

If set, Bash includes filenames beginning with a ‘.’ in the results of filename expansion.
#+begin_src bash
shopt -s dotglob
#+end_src

If set, aliases are expanded as described below under Aliases, Aliases.
#+begin_src bash
# shopt -s expand_aliases
#+end_src

If set, the extended pattern matching features described above (see Pattern Matching) are enabled.
#+begin_src bash
# shopt -s extglob
#+end_src

If set, patterns which fail to match filenames during filename expansion result in an expansion error.
#+begin_src bash
# shopt -s failglob
#+end_src

If set, the pattern ‘**’ used in a filename expansion context will match all files and zero or more directories and subdirectories.
If the pattern is followed by a ‘/’, only directories and subdirectories match.
#+begin_src bash
# shopt -s globstar
#+end_src
Not using this as it's too slow! - Use [[id:2870e3ab-aa92-4006-9899-372135ae00c4][home-brewed @]] instead

If set, shell error messages are written in the standard GNU error message format.
#+begin_src bash
# shopt -s gnu_errfmt
#+end_src

If set, the history list is appended to the file named by the value of the HISTFILE variable when the shell exits, rather than overwriting the file.
#+begin_src bash
shopt -s histappend
#+end_src

If set, and Readline is being used, a user is given the opportunity to re-edit a failed history substitution.
#+begin_src bash
shopt -s histreedit
#+end_src

If set, and Readline is being used, the results of history substitution are not immediately passed to the shell parser.
Instead, the resulting line is loaded into the Readline editing buffer, allowing further modification.
eg. commands using (!, !!, etc.) will print to shell first for confirmation and not auto-execute
#+begin_src bash
shopt -s histverify
#+end_src

If set, Bash will send SIGHUP to all jobs when an interactive login shell exits (see [[https://www.gnu.org/software/bash/manual/html_node/Signals.html][Signals]]).
#+begin_src bash
shopt -s huponexit
#+end_src

If set, and job control is not active, the shell runs the last command of a pipeline not executed in the background
#+begin_src bash
shopt -s lastpipe
#+end_src

If enabled, and the cmdhist option is enabled, multi-line commands are saved to the history with embedded newlines rather than using semicolon separators where possible.
#+begin_src bash
shopt -s lithist
#+end_src

If set, and a file that Bash is checking for mail has been accessed since the last time it was checked, the message "The mail in mailfile has been read" is displayed.
#+begin_src bash
shopt -s mailwarn
#+end_src

If set, and Readline is being used, Bash will not attempt to search the PATH for possible completions when completion is attempted on an empty line.
#+begin_src bash
# shopt -s no_empty_cmd_completion
#+end_src

If set, Bash matches filenames in a case-insensitive fashion when performing filename expansion.
#+begin_src bash
# shopt -s nocaseglob
#+end_src

If set, Bash matches patterns in a case-insensitive fashion when performing matching while executing case or =[[= conditional commands,
when performing pattern substitution word expansions, or when filtering possible completions as part of programmable completion.
#+begin_src bash
# shopt -s nocasematch
#+end_src

If set, Bash allows filename patterns which match no files to expand to a null string, rather than themselves.
#+begin_src bash
# shopt -s nullglob
#+end_src

If this is set, the shift builtin prints an error message when the shift count exceeds the number of parameters.
#+begin_src bash
shopt -s shift_verbose
#+end_src

#+begin_src bash
set -o noclobber
#set -o vi
set bell-style none
# Otherwise some completions will fail
set +o nounset
#+end_src

** ENVIRONMENT variables
*** history
NOTE: exporting a variable makes it available for child processes via the environment

Increase size of history in the terminal. Default is a measly 512 lines
#+begin_src bash
export HISTSIZE=65535
export HISTFILESIZE=65535
#+end_src

Add timestamps to history
#+begin_src bash
export HISTTIMEFORMAT="%F %T  "
#+end_src

Ignore duplicates and trivial one/two char commands as I've a bad habit of doing =cl= all the time.
Furthermore, I can add all the commands I want to ignore to it as well.
#+begin_src bash
export HISTIGNORE='?:??:history*:sosa:sosc:sosf:sosp:cd:que*:lla*'
#+end_src

=ignoredups= allows me to ignore the same command type multiple times consecutively
=ignorespace= does not add commands that start with a space to the history just in case I don't want to log something
=ignoreboth= does both
#+begin_src bash
export HISTCONTROL=ignoreboth
#+end_src

Keeps history forever. Requires ~PROMPT_COMMAND='history -a; history -r'~
#+begin_src bash :tangle no
HISTFILE="$HOME/.history_bash/$(date +%Y/%m/%d)_${HOSTNAME%%.*}_${USER}_$$"
mkdir -p $(dirname $HISTFILE)
#+end_src
However, a downside of this is that when sessions span multiple days, commands end up getting logged in the wrong files
Thus, I've moved this to =PROMPT_COMMAND= instead to keep the HISTFILE current.

*** misc

#+begin_src bash
export EDITOR=vim
export VISUAL=gvim
#+end_src

Make less more friendly for non-text input files, see lesspipe(1)
#+begin_src bash
export MANPAGER=less
export PAGER=less
[[ -x /usr/bin/lesspipe ]] && eval "$(SHELL=/bin/sh lesspipe)"
#+end_src

#+begin_src bash
export HOSTNAME="$(hostname)"
export LANG=en_US.UTF-8
#+end_src

** colors
*** ls colors
See [[id:2823d31a-572c-44ec-80e1-84acbbb6412e][dircolors]]
#+begin_src bash
if [[ -x /usr/bin/dircolors ]]; then
    _dircolors=${XDG_CONFIG_HOME:-$HOME/.config}/dotfiles/bash/dircolors
    [[ -r $_dircolors ]] && eval "$(/usr/bin/dircolors -b $_dircolors)" || eval "$(/usr/bin/dircolors -b)"
fi
#+end_src

*** base16 themes
#+begin_src bash
export BASE16_SHELL=${XDG_CONFIG_HOME:-$HOME/.config}/base16-shell
[[ -n "$PS1" ]] && [[ -s $BASE16_SHELL/profile_helper.sh ]] && eval "$($BASE16_SHELL/profile_helper.sh)"
base16_solarized-light
#+end_src

*** colored man pages with less
#+begin_src bash
man() {
    env \
        LESS_TERMCAP_mb=$(printf "\e[1;31m") \
        LESS_TERMCAP_md=$(printf "\e[1;31m") \
        LESS_TERMCAP_me=$(printf "\e[0m") \
        LESS_TERMCAP_se=$(printf "\e[0m") \
        LESS_TERMCAP_so=$(printf "\e[1;44;33m") \
        LESS_TERMCAP_ue=$(printf "\e[0m") \
        LESS_TERMCAP_us=$(printf "\e[1;32m") \
        command man "$@"
}
#+end_src

** helper functions
Collection of utilities to deal with all VCS related stuff

#+begin_src bash
vcs::is_in_git_repo() {
    local _cwd=$PWD
    if (( $# > 0 )); then
        command cd $1
    fi

    git rev-parse HEAD &> /dev/null
    local _ret=$?

    if (( $# > 0 )); then
        command cd $_cwd
    fi

    return $_ret
}

vcs::is_in_perforce_repo() {
    local _cwd=$PWD
    if (( $# > 0 )); then
        command cd $1
    fi

    p4 info &> /dev/null
    local _ret=$?

    if (( $# > 0 )); then
        command cd $_cwd
    fi

    return $_ret
}

vcs::is_in_repo() {
    vcs::is_in_git_repo "$@" || vcs::is_in_perforce_repo "$@"
}

vcs::get_type() {
    # Description: Check if specified directory is under a Version-controlled system
    # Arguments: 1 - Variable to return VCS type
    #            2 - Directory to check. If skipped, defaults to PWD

    if vcs::is_in_git_repo "$@"; then
        echo "git"
    elif vcs::is_in_perforce_repo "$@"; then
        echo "p4"
    else
        # No VCS. Return empty string
        echo ""
    fi
}

vcs::get_branch() {
    # Description: If PWD is under a VCS, return the branch. If not, return an empty string
    # Arguments:
    # - $1 (optional): Use that as the VCS type instead of calculating it

    local _vcs_type=${1-$(vcs::get_type)}
    #echo "DEBUG: VCS Type=$_vcs_type (vcs::get_branch)"

    if [[ $_vcs_type == "git" ]]; then
        git symbolic-ref --short HEAD 2> /dev/null
    elif [[ $_vcs_type == "p4" ]] && [[ -n "$REPO_PATH" ]] && [[ -f "$REPO_PATH/configuration_id" ]]; then
        echo "$(sed 's/@.*//' "$REPO_PATH/configuration_id" 2> /dev/null)"
    else
        echo ""
    fi
}

vcs::get_status() {
    # Description: Get the status of the VCS - works only for git at the moment
    # Arguments:
    # - $1 (optional): Use as the VCS type instead of calculating it
    # - $2 (optional): Use as the VCS branch instead of calculating it

    local _vcs_type=${1-$(vcs::get_type)}
    local _vcs_branch=${2-$(vcs::get_branch $_vcs_type)}

    if [[ "$_vcs_type" == "git" ]]; then
        if $(echo "$(git log origin/$_vcs_branch..HEAD 2> /dev/null)" | grep '^commit' &> /dev/null); then
            echo "staged"
        elif [[ -n $(git status -s --ignore-submodules=dirty  2> /dev/null) ]]; then
            echo "modified"
        else
            echo "committed"
        fi
    fi
}

vcs::get_root() {
    if vcs::is_in_git_repo "$@"; then
        echo "$(git rev-parse --show-toplevel)"
    elif vcs::is_in_perforce_repo "$@"; then
        echo "$REPO_PATH"
    else
        echo ""
    fi
}
#+end_src

** aliases/utilities
Provide a default alias here for the most commonly found tools eg. =grep=, =find= etc.
They might be overridden later by other similar tools if available eg. =ag=, =rg=, =fd= etc.

*Aliases v/s Functions*
A big limitation of aliases is that they are only expanded as the first argument, or after another alias with a trailing space on the end of the command.

eg. let's say I have the following aliases set up
#+begin_src bash :tangle no
alias g=grep
alias vq='v -q <(!!)'
#+end_src
Now, if I run =g SOMETHING= followed by =vq= then =vq= doesn't run as expected because ~!!~ expands to 'g SOMETHING'.
However, in the expanded form, 'g' doesn't get replaced with grep because of the afore-mentioned limitation.

To avoid this, I use functions for my most commonly used aliases so that they work everywhere and, aliases only if I'm sure that they won't be used in the middle of a command.

#+begin_src bash
alias ls='ls -FLH --color=always'
alias l=ls
alias la='ls -A'
alias ll='ls -lh'
alias lla='ll -A'
#+end_src

#+begin_src bash
alias c=clear
alias cl="c;l"

#alias echo '\echo -e'
#alias lock='/usr/local/bin/xlock'
alias mv='mv -vi'
alias cp='cp -vi'
alias rm='rm -vi'
alias rd='rm -rvf'
alias ln='ln -svi'
alias df='df -h'
alias pppath='tr ":" "\n" <<< $PATH'
alias clnpath='export PATH=$(tr ":" "\n" <<< $PATH | perl -ne "print unless \$seen{\$_}++" | paste -s -d":")'

if hash bat 2> /dev/null; then
    alias C=bat
else
    alias C=cat
fi
alias P=$PAGER
alias hh='history | tail'
alias x=exit
alias k9='kill -9'
alias j='jobs -l'
alias pls='sudo $(history -p !!)'
duh() { du -h "$@" | sort -rh; }
#+end_src

From https://askubuntu.com/a/185746/38952
Using ww twice ensures that the output is not truncated to the width of the terminal
#+begin_src bash
psgrep() { ps wwup $(command pgrep -f "$@"); }
#+end_src

bookmarks for commonly used configs
#+begin_src bash
alias gosc='$VISUAL ~/.bashrc'
alias gosa='$VISUAL ~/.dotfiles/bash/aliases'
alias gosf='$VISUAL ~/.dotfiles/bash/bashrc-func'
alias gost='$VISUAL ~/.dotfiles/tmux/tmux.conf'
alias gosx='$VISUAL ~/.Xresources'
alias sosc='. ~/.bashrc && clnpath && echo Sourced bashrc'
alias sosa='. ~/.dotfiles/bash/aliases && . ~/.dotfiles/bash/bashrc-func && echo Sourced aliases and functions'
#+end_src

