bash/bashrc.org
*** query
=which= on steroids. Shows aliases and function definitions recursively.
Since this function deals with aliases, it cannot be made into a stand-alone script since aliases are not accessible inside subshells.
#+begin_src bash
query() (
# Yep, parentheses is correct. It makes this a subshell function allowing the definition to be inaccessible from outside
# Thus, no more polluting of shell space with helper functions

_query_help_() {                                                                                                  # {{{1
  echo "Usage:"
  echo "    query [OPTION]... INPUT..."
  echo
  echo "INPUT can be one or more alias, file, command, function etc. but must be specified last"
  echo
  echo "Options:"
  echo "    -h, --help             Print this help"
  echo "        --ascii            Use ASCII instead of extended characters"
  echo "        --color            Colorize output"
  echo "        --nocolor          Don't colorize output"
  echo "    -d, --max-depth <N>    Recurse only N-levels deep. If N=0, query only the specified input"
  echo "        --nodefine         Don't print the function definition"
}


_query_parse_args_() {                                                                                            # {{{1
  #echo "DEBUG: Parse:'$@'"

  # Default values of options
  _query_opts[ascii]=0
  _query_opts[color]=1
  _query_opts[define]=1
  _query_opts[depth]=-1
  _query_opts[input]=""
  _query_opts[level]=0

  local _i
  for _i in "$@"; do
    if [[ $_i =~ ^-h$ ]] || [[ $_i =~ ^--help$ ]]; then
      _query_help_
      return 0
    fi
  done

  local _opt_end=false
  while (( $# > 0 )); do
    #echo "DEBUG: Arg:'$1'"
    case $1 in
      --?*)
        ;&
      -[[:alpha:]])
        if ! $_opt_end && [[ ! $1 =~ ^-l$ ]] && [[ ! $1 =~ ^--level$ ]]; then
          _cmd_recurse+=("$1")
        fi
        ;;&

      --ascii)
        _query_opts[ascii]=1
        ;;

      --color)
        _query_opts[color]=1
        ;;
      --nocolor)
        _query_opts[color]=0
        ;;

      --level|-l)
        # Internal use only. Should not be specified by the user
        shift
        if [[ ! $1 =~ ^[0-9]+$ ]]; then
          echo "ERROR: Current level must be a number"
          return 1;
        fi
        _query_opts[level]=$1
        ;;

      --max-depth|-d)
        shift
        if [[ ! $1 =~ ^[0-9]+$ ]]; then
          echo -e "ERROR: Max-depth must be a number\n"
          _query_help_
          return 1;
        fi
        _query_opts[depth]=$1
        ;;

      --nodefine)
        #echo "Don't print function definition"
        _query_opts[define]=0
        ;;

      --)
        # Standard shell separator between options and arguments
        if ! $_opt_end; then
          _opt_end=true
        fi
        ;;

      -*)
        if ! $_opt_end; then
          echo -e "ERROR: Invalid option: '$1'"
          _query_help_
          return 1;
        fi
        ;&

      ,*)
        # To support multiple inputs
        while (( $# > 1 )); do
          query ${_cmd_recurse[@]} --level 0 $1
          shift
          echo -e "\n"
        done
        _query_opts[input]=$1
        ;;
    esac
    shift
  done

  # If you don't give me something to work with, then what am I supposed to do?
  if [[ -z ${_query_opts[input]} ]]; then
    echo "ERROR: No input specified"
    return 1;
  fi
}


_query_alias_() {                                                                                                 # {{{1
  echo "${_query_pp[sep]}${_query_pp[input]} (${_query_pp[type]})"
  while read; do
    echo "${_query_pp[spc]}${REPLY}";
  done < <(command type -a -- "${_query_opts[input]}" | command head -n2)

  # Recurse
  if (( ${_query_opts[depth]} == -1 )) || (( ${_query_opts[level]} < ${_query_opts[depth]} )); then
    local _out_arr=()
    read -a _out_arr <<< $(command type -a -- ${_query_opts[input]} | command grep -Po "(?<=aliased to .).*(?='$)")
    local _query_next=()
    local _level_next=$((${_query_opts[level]} + 1))
    _query_tree[$_level_next]=0

    local _i=0
    for _i in ${_out_arr[@]}; do
      if [[ "$_i" != "${_query_opts[input]}" ]]; then
        if [[ $(command type -t -- "$_i") =~ file|function|alias ]]; then
          _query_tree[$_level_next]=$(( ${_query_tree[$_level_next]} + 1 ))
          _query_next+=("$_i")
        fi
      fi
    done
    for _i in ${_query_next[@]}; do
      _query_tree[$_level_next]=$(( ${_query_tree[$_level_next]} - 1 ))
      query "${_cmd_recurse[@]}" --level $_level_next $_i
    done
  fi
}


_query_file_() {                                                                                                  # {{{1
  echo "${_query_pp[sep]}${_query_pp[input]} (${_query_pp[type]})"
  while read; do
    echo "${_query_pp[spc]}${REPLY}";
  done < <(command type -a -- "${_query_opts[input]}" | command head -n1)
}


_query_function_() {                                                                                              # {{{1
  echo "${_query_pp[sep]}${_query_pp[input]} (${_query_pp[type]})"
  shopt -s extdebug
  IFS=" " read -a _arr <<< $(command declare -F -- "${_query_opts[input]}")
  shopt -u extdebug
  echo -e "${_query_pp[spc]}Defined in ${_arr[2]} at line ${_arr[1]}"

  # Print the function definition
  if [[ "${_query_opts[define]}" == "1" ]]; then
    while read; do
      echo "${_query_pp[spc]}${REPLY}";
    done < <(command type -a -- "${_query_opts[input]}" | command tail -n+2)
  fi
}


_query_pp_() {                                                                                                    # {{{1

  _query_pp[spc]=""
  _query_pp[sep]=""

  # Setup the tree-drawing characters
  if [[ "${_query_opts[ascii]}" == "1" ]]; then
    local _v_bar='|'
    local _h_bar='-'
    local _x_bar='+'
    local _xl_bar='\'
  else
    local _v_bar='│'
    local _h_bar='─'
    local _x_bar='├'
    local _xl_bar='└'
  fi
  _query_pp[xl]=${_query_pp[xl]:-$_x_bar}

  # Colorize the output?
  if [[ "${_query_opts[color]}" == "1" ]]; then
    local _c_type="$(tput setaf 4)"
    local _c_input="$(tput bold)$(tput setaf 2)"
    local _c_reset="$(tput sgr0)"
  else
    local _c_type=""
    local _c_input=""
    local _c_reset=""
  fi

  if [[ "${_query_opts[level]}" != "0" ]]; then
    local _i=0
    for (( _i=1; _i <= ${_query_opts[level]}; _i++ )); do
      #echo ${_query_tree[$_i]}
      if (( ${_query_tree[$_i]} > 0 )); then
        _query_pp[spc]="${_query_pp[spc]}${_v_bar}   "
      else
        _query_pp[spc]="${_query_pp[spc]}    "
      fi
    done
    if (( ${_query_tree[${_query_opts[level]}]} == 0 )); then
      _x_bar=$_xl_bar
    fi
    _query_pp[sep]="${_query_pp[spc]%????}${_x_bar}${_h_bar}${_h_bar} "
    echo "${_query_pp[spc]%????}${_v_bar}"
  fi

  _query_pp[type]="${_c_type}${_type}${_c_reset}"
  _query_pp[input]="${_c_input}${_query_opts[input]}${_c_reset}"
}
# }}}1

  #echo "DEBUG: Cmd='$@'"
  # Default values for options
  local -A _query_opts=()
  local -a _cmd_recurse=()
  _query_parse_args_ "$@"
  local _ret_val=$?
  if [[ "$_ret_val" != "0" ]]; then
    return $_ret_val;
  fi

  local _type=$(command type -t -- "${_query_opts[input]}")
  #echo "DEBUG: Input='${_query_opts[input]}', Type='$_type'"

  # Pretty-print the tree structure for recursive lookups
  local -A _query_pp=()
  if (( ${_query_opts[level]} == 0 )); then
    echo
    local -a _query_tree=()
  fi
  _query_pp_

  case $_type in
    "file")
      _query_file_
      ;;
    "function")
      _query_function_
      ;;
    "alias")
      _query_alias_
      ;;
    ,*)
      command type -a -- "${_query_opts[input]}"
      ;;
  esac
)
#+end_src

#+begin_src bash
  alias que=query
#+end_src

*** [[https://github.com/BurntSushi/ripgrep][ripgrep]]
:PROPERTIES:
:header-args+: :tangle (if (executable-find "rg") "bashrc_literate" "no")
:END:
This will be tangled only if =rg= exists
#+begin_src bash
export RIPGREP_CONFIG_PATH=${XDG_CONFIG_HOME:-$HOME/.config}/dotfiles/ripgreprc
alias g=rg
#+end_src

**** ripgrep config file
:PROPERTIES:
:header-args+: :tangle (if (executable-find "rg") "../ripgreprc" "no")
:END:
#+begin_src conf
# This is a tangled file. Do not make any changes here. All changes should preferably be made in the original Org file.
# Use =org-babel-tangle-jump-back-to-org= to jump back to it from any code block.
# If any changes are made here, use =org-babel-detangle= to add it back to the original Org mode file.

# Redefine the cpp extension to make it easier to parse and use it with fd. Start by first clearing it
--type-clear
cpp
# Next, instead of simply flattening it out, let's be a little smarter about it
# First define separate types for header and source files
--type-add
chdr:*.h, *.H, *.h.in, *.H.in, *.hpp, *.hpp.in, *.hxx, *.hxx.in, *.hh, *.hh.in
--type-add
csrc:*.C, *.C.in, *.cpp, *.cpp.in, *.cxx, *.cxx.in, *.cc, *.cc.in, *.inl, *.ipp, *.tpp
# Now, define cpp to be a union of the two
--type-add
cpp:include:chdr
--type-add
cpp:include:csrc

--type-add
rdl:*.rdl

--type-add
sbs:*.sbs

--type-add
hdl:include:verilog

--type-add
hdl:*.x

# Because who cares about case!?
--smart-case
#+end_src

*** vim
#+begin_src bash
alias v=vim
alias vi="vim -u NORC -U NORC -N --cmd 'set rtp="'$VIM,$VIMRUNTIME,$VIM/after'"'"
# alias vi='vim --config NONE'
#+end_src

Open results of the last shell command in vim quickfix.
Very useful for searching something using =rg= etc. and iterating through the results in vim
#+begin_src bash
vq() { v -q <(eval "$(fc -nl -1) $@"); }
#+end_src

Opening up vimdiff takes some observable amount of time. This will run it only if required.
Using -f keeps the window in the foreground and prevents a whole bunch of diffs opening at the same time
#+begin_src bash
gvim_diff() {
    # Check to see if all files are present. If not, return.
    for i in "$@"; do
        [[ ! -f "$i" ]] && return
    done

    # If there are no differences, print that files are identical and return
    command diff -qs "$@" && return

    # Run vimdiff only if there are differences and all files are present
    gvim -df -c 'set nobackup' "$@"
}
alias vd=gvim_diff
#+end_src

*** tmux
#+begin_src bash
source ${XDG_CONFIG_HOME:-$HOME/.config}/dotfiles/tmux/tmuxw.bash
alias tmux='tmuxw'
alias tm='tmux'
#+end_src

** prompt
[[https://wiki.archlinux.org/index.php/Bash/Prompt_customization][Prompt Customization on ArchWiki]]:
=PS1= is the primary prompt displayed before each command.
=PS2= is the secondary prompt used in case of a multi-line command
=PROMPT_COMMAND= is evaluated right before PS1 is displayed.

I use this by assigning it to a function which updates PS1 and PS2 allowing me to have a dynamic prompt
#+begin_src bash
PROMPT_COMMAND=__setprompt
#+end_src

Use bash builtin =checkwinsize= option for terminals which fail to properly set the $COLUMNS variable. (bug workaround)
#+begin_src bash
shopt -s checkwinsize
#+end_src

*** Colors and helper functions
These are the color init strings for the basic file types. A color init string consists of one or more of the following numeric codes:
Attribute codes: 00:Normal, 01:Bold, 04:Underline, 05=Blink, 06:Outline, 07:Reverse, 08:Concealed

| Color   | Foreground | Background |
|---------+------------+------------|
| black   |         30 |         40 |
| red     |         31 |         41 |
| green   |         32 |         42 |
| yellow  |         33 |         43 |
| blue    |         34 |         44 |
| magenta |         35 |         45 |
| cyan    |         36 |         46 |
| white   |         37 |         47 |

NOTE: Non-printable sequences should be enclosed in \[ and \] else it'll cause long commands to not wrap correctly
These are some colors and line-graphics that I use in different prompts so I'm putting them in one place.
#+begin_src bash :tangle no :noweb-ref prompt-common
local _reset="\[$(tput sgr0)\]"
local _bold="\[$(tput bold)\]"
local _fg_black="\[$(tput setaf 0)\]"
local _fg_light_black="\[$(tput setaf 8)\]"
local _fg_red="\[$(tput setaf 1)\]"
local _fg_yellow="\[$(tput setaf 3)\]"
local _fg_green="\[$(tput setaf 2)\]"
local _fg_blue="\[$(tput setaf 4)\]"
local _fg_purple="\[$(tput setaf 5)\]"

# Set line graphics
local _dash="─"
local _ulcorner="┌"
# local _ulcorner="╭"
local _llcorner="└"
# local _llcorner="╰"
#+end_src

Contract the following: /proj/ch_func_dev{1:0}/ASPEN_HIGHLANDS -> ~AH{1:0}
Contract more if it's my directory
#+begin_src bash
__get_compact_pwd() {
    local _pwd=$PWD
    if [[ -n "$HOME" ]] && [[ "$_pwd" =~ ^"$HOME" ]]; then
        _pwd=${_pwd/#$HOME/\~};
    fi
    echo $_pwd
}
#+end_src

